#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-deployment/runs/run-7hvTjY499JXzgMH2

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.template_file.worker_user_data: Refreshing state... [id=7b29c053fc5cb761c95c9482964ea488b26051d2842dc795acf8623781d3bc95]
data.aws_iam_policy_document.spotfleet_iam_spot_policy: Refreshing state... [id=931116587]
data.aws_iam_policy_document.vmimport_s3: Refreshing state... [id=2072117659]
data.aws_iam_policy_document.imagebuilder_stage: Refreshing state... [id=2674406226]
data.aws_iam_policy_document.vmimport_trust: Refreshing state... [id=4085548158]
data.aws_ami.rhel8_x86: Refreshing state... [id=ami-0c82f7789103a1e20]
data.aws_iam_policy_document.vmimport_ec2: Refreshing state... [id=690884195]
data.aws_vpc.external_vpc: Refreshing state... [id=vpc-78468405]
data.aws_iam_policy_document.imagebuilder_prod: Refreshing state... [id=1330906063]
aws_iam_user.imagebuilder_stage: Refreshing state... [id=imagebuilder-stage]
aws_s3_bucket.imagebuilder_stage: Refreshing state... [id=imagebuilder-service-stage]
data.aws_vpc.internal_vpc: Refreshing state... [id=vpc-06d6127910664367d]
aws_iam_user.imagebuilder_prod: Refreshing state... [id=imagebuilder-prod]
data.aws_iam_policy_document.spotfleet_iam_role_policy: Refreshing state... [id=1116480091]
data.aws_caller_identity.current: Refreshing state... [id=933752197999]
data.aws_availability_zones.available: Refreshing state... [id=us-east-1]
aws_s3_bucket.imagebuilder_prod: Refreshing state... [id=imagebuilder-service-prod]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy]
aws_iam_policy.imagebuilder_stage_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-stage-workers-s3]
aws_iam_policy.imagebuilder_prod_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-prod-workers-s3]
aws_iam_role.vmimport: Refreshing state... [id=vmimport]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder-spot-fleet-role]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2]
aws_iam_user_policy_attachment.imagebuilder_stage_s3: Refreshing state... [id=imagebuilder-stage-20201113204258227600000002]
aws_iam_user_policy_attachment.imagebuilder_prod_s3: Refreshing state... [id=imagebuilder-prod-20201113204258223300000001]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport-20201116212912128900000002]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder-spot-fleet-role-20201116215323938600000003]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder-spot-fleet-role-20201116215323839200000002]
aws_iam_user_policy_attachment.imagebuilder_prod_vmimport: Refreshing state... [id=imagebuilder-prod-20201116212912287200000003]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport-20201116212912375000000005]
aws_iam_user_policy_attachment.imagebuilder_stage_vmimport: Refreshing state... [id=imagebuilder-stage-20201116212912312400000004]
data.aws_subnet_ids.external_subnets: Refreshing state... [id=vpc-78468405]
aws_security_group.allow_egress: Refreshing state... [id=sg-09bcf282053bc8635]
aws_security_group.allow_icmp: Refreshing state... [id=sg-01794fd088245ef29]
aws_security_group.allow_cockpit: Refreshing state... [id=sg-080c4af13b254be34]
aws_security_group.allow_ssh: Refreshing state... [id=sg-04c3b57abc095a9ab]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-0875d858ff2d5a00c]
data.aws_subnet_ids.internal_subnets: Refreshing state... [id=vpc-06d6127910664367d]
aws_launch_template.worker_x86: Refreshing state... [id=lt-0cbb229d67d85ee00]
aws_spot_fleet_request.imagebuilder_worker_x86: Refreshing state... [id=sfr-c737bfd2-31dd-4762-88de-6de5eafc4894]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_launch_template.worker_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_x86" {
        arn                     = "arn:aws:ec2:us-east-1:933752197999:launch-template/lt-0cbb229d67d85ee00"
      ~ default_version         = 3 -> (known after apply)
        disable_api_termination = false
        id                      = "lt-0cbb229d67d85ee00"
        image_id                = "ami-0c82f7789103a1e20"
        instance_type           = "t3.medium"
        key_name                = "mhayden"
      ~ latest_version          = 3 -> (known after apply)
        name                    = "imagebuilder-worker-x86"
        security_group_names    = []
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder worker"
            "ServiceOwner" = "Image Builder"
        }
        update_default_version  = true
        user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybQpTWVNURU1fSE9TVE5BTUU9d29ya2VyLWZsZWV0LXRlc3RpbmcKCiMgU2V0IHRoZSBob3N0bmFtZSB0byB0aGUgaG9zdG5hbWUgcGFzc2VkIGJ5IHRlcnJhZm9ybS4KaG9zdG5hbWVjdGwgc2V0LWhvc3RuYW1lICRTWVNURU1fSE9TVE5BTUUKCmRuZiAteSBpbnN0YWxsIGNvY2twaXQgY29ja3BpdC1jb21wb3NlciBvc2J1aWxkLWNvbXBvc2VyCnN5c3RlbWN0bCBlbmFibGUgLS1ub3cgY29ja3BpdC5zb2NrZXQKc3lzdGVtY3RsIGVuYWJsZSAtLW5vdyBvc2J1aWxkLWNvbXBvc2VyLnNvY2tldAoK"
      ~ vpc_security_group_ids  = [
          - "sg-01794fd088245ef29",
          - "sg-04c3b57abc095a9ab",
          - "sg-080c4af13b254be34",
          - "sg-09bcf282053bc8635",
        ] -> (known after apply)

        block_device_mappings {
            device_name = "/dev/sda1"

            ebs {
                iops        = 0
                volume_size = 50
                volume_type = "gp2"
            }
        }

        tag_specifications {
            resource_type = "instance"
            tags          = {
                "AppCode"      = "IMGB-001"
                "Name"         = "Image Builder worker"
                "ServiceOwner" = "Image Builder"
            }
        }
        tag_specifications {
            resource_type = "volume"
            tags          = {
                "AppCode"      = "IMGB-001"
                "Name"         = "Image Builder worker"
                "ServiceOwner" = "Image Builder"
            }
        }
    }

  # aws_security_group.allow_cockpit must be replaced
-/+ resource "aws_security_group" "allow_cockpit" {
      ~ arn                    = "arn:aws:ec2:us-east-1:933752197999:security-group/sg-080c4af13b254be34" -> (known after apply)
        description            = "Allow cockpit access"
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-080c4af13b254be34" -> (known after apply)
        ingress                = [
            {
                cidr_blocks      = [
                    "10.0.0.0/8",
                ]
                description      = "cockpit"
                from_port        = 9090
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 9090
            },
        ]
        name                   = "allow-cockpit"
      ~ owner_id               = "933752197999" -> (known after apply)
        revoke_rules_on_delete = false
        tags                   = {
            "AppCode"      = "IMGB-001"
            "Name"         = "allow-cockpit"
            "ServiceOwner" = "Image Builder"
        }
      ~ vpc_id                 = "vpc-06d6127910664367d" -> "vpc-78468405" # forces replacement
    }

  # aws_security_group.allow_egress must be replaced
-/+ resource "aws_security_group" "allow_egress" {
      ~ arn                    = "arn:aws:ec2:us-east-1:933752197999:security-group/sg-09bcf282053bc8635" -> (known after apply)
        description            = "Allow egress traffic"
        egress                 = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 0
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "-1"
                security_groups  = []
                self             = false
                to_port          = 0
            },
        ]
      ~ id                     = "sg-09bcf282053bc8635" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
        name                   = "allow-egress"
      ~ owner_id               = "933752197999" -> (known after apply)
        revoke_rules_on_delete = false
        tags                   = {
            "AppCode"      = "IMGB-001"
            "Name"         = "allow-egress"
            "ServiceOwner" = "Image Builder"
        }
      ~ vpc_id                 = "vpc-06d6127910664367d" -> "vpc-78468405" # forces replacement
    }

  # aws_security_group.allow_icmp must be replaced
-/+ resource "aws_security_group" "allow_icmp" {
      ~ arn                    = "arn:aws:ec2:us-east-1:933752197999:security-group/sg-01794fd088245ef29" -> (known after apply)
        description            = "Allow ICMP access"
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-01794fd088245ef29" -> (known after apply)
        ingress                = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = "ICMP"
                from_port        = 0
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "icmp"
                security_groups  = []
                self             = false
                to_port          = 0
            },
        ]
        name                   = "allow-icmp"
      ~ owner_id               = "933752197999" -> (known after apply)
        revoke_rules_on_delete = false
        tags                   = {
            "AppCode"      = "IMGB-001"
            "Name"         = "allow-icmp"
            "ServiceOwner" = "Image Builder"
        }
      ~ vpc_id                 = "vpc-06d6127910664367d" -> "vpc-78468405" # forces replacement
    }

  # aws_security_group.allow_ssh must be replaced
-/+ resource "aws_security_group" "allow_ssh" {
      ~ arn                    = "arn:aws:ec2:us-east-1:933752197999:security-group/sg-04c3b57abc095a9ab" -> (known after apply)
        description            = "Allow SSH access"
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-04c3b57abc095a9ab" -> (known after apply)
        ingress                = [
            {
                cidr_blocks      = [
                    "10.0.0.0/8",
                ]
                description      = "ssh"
                from_port        = 22
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 22
            },
        ]
        name                   = "allow-ssh"
      ~ owner_id               = "933752197999" -> (known after apply)
        revoke_rules_on_delete = false
        tags                   = {
            "AppCode"      = "IMGB-001"
            "Name"         = "allow-ssh"
            "ServiceOwner" = "Image Builder"
        }
      ~ vpc_id                 = "vpc-06d6127910664367d" -> "vpc-78468405" # forces replacement
    }

  # aws_security_group.inernal_allow_egress will be created
  + resource "aws_security_group" "inernal_allow_egress" {
      + arn                    = (known after apply)
      + description            = "Allow egress traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "internal-allow-egress"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "allow-egress"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_id                 = "vpc-06d6127910664367d"
    }

  # aws_security_group.internal_allow_trusted will be created
  + resource "aws_security_group" "internal_allow_trusted" {
      + arn                    = (known after apply)
      + description            = "Allow trusted access"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "internal-allow-trusted"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "internal-allow-trusted"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_id                 = "vpc-06d6127910664367d"
    }

  # aws_spot_fleet_request.imagebuilder_worker_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "imagebuilder_worker_x86" {
        allocation_strategy                 = "lowestPrice"
      ~ client_token                        = "terraform-20201116225141337800000002" -> (known after apply)
        excess_capacity_termination_policy  = "Default"
        fleet_type                          = "maintain"
        iam_fleet_role                      = "arn:aws:iam::933752197999:role/imagebuilder-spot-fleet-role"
      ~ id                                  = "sfr-c737bfd2-31dd-4762-88de-6de5eafc4894" -> (known after apply)
        instance_interruption_behaviour     = "terminate"
        instance_pools_to_use_count         = 1
      ~ load_balancers                      = [] -> (known after apply)
        replace_unhealthy_instances         = false
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder worker fleet"
            "ServiceOwner" = "Image Builder"
        }
        target_capacity                     = 1
      ~ target_group_arns                   = [] -> (known after apply)
        terminate_instances_with_expiration = true
        wait_for_fulfillment                = false

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0cbb229d67d85ee00" -> null
              - version = "3" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0cbb229d67d85ee00"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_vpc_endpoint.external_vpc_s3 will be created
  + resource "aws_vpc_endpoint" "external_vpc_s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Image Builder S3 VPC endpoint"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-78468405"
    }

Plan: 8 to add, 1 to change, 5 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*